{
  "categories": [
    {
      "title": "🎯 planned must-have features",
      "description": "non-negotiable features required for the game's release",
      "items": [
        {
          "title": "🏃 Improved Character Gameplay",
          "image": "/roadmap/gasp.webp",
          "description": "Our current character is still based on the old UE4 Mannequin, and it definitely shows its age. The animations are outdated, the native meshes aren't great, and the overall quality doesn't set a good standard. There are also a lot of missing or unfinished mechanics, like proning, and some existing animations just don't feel right. Movement needs a serious rework too as it's not as fluid or satisfying as it should be.\n\nWith the upgrade to Unreal Engine 5.5, we're looking into integrating the new Game Animation Sample Project (GASP) from Unreal. It brings a more modern and polished animation setup that could help us improve overall gameplay feel. We'll be studying how we can make use of it while refining our character's mechanics to ensure everything is smooth, responsive, and up to the level we want.",
          "labels": ["gameplay"]
        },
        {
          "title": "🗺️ Built-in Map",
          "video": "/roadmap/map.webm",
          "description": "We are aiming towards an open-world map that's not just there for show but actually fun to play in. The idea is to create a space that serves as the foundation for multiple game-modes, making it a versatile and also engaging.\n\nIt'll also act as our main testing ground, allowing us to fine-tune all the game's features in a real gameplay setting. Our goal is to make a world that feels dynamic, adaptable, and packed with opportunities for different kinds of experiences.",
          "labels": ["gameplay"]
        },
        {
          "title": "✈️ Airplanes",
          "image": "/roadmap/airplane.webp",
          "description": "We've already got a boat entity in place, and now it's time to take things to the skies with an airplane. This means developing proper aircraft mechanics and making sure they can be fully customizable through scripting.\n\nSince it's all based on physics simulation, we won't need any external integrations to make it work. The focus will be on designing the entity itself, fine-tuning its mechanics, and exposing the necessary systems so that it can be customized and expanded by the community. Modders will be able to bring in their own custom meshes and assets, making it as flexible and moddable as possible.",
          "labels": ["gameplay", "modding"]
        },
        {
          "title": "🚁 Helicopters",
          "image": "/roadmap/helicopter.webp",
          "description": "As well with the Airplane entity, another important gameplay feature is bringing helicopters into the game. While similar in concept, helicopters come with their own unique mechanics, requiring specialized flight physics and controls. Just like with airplanes, we'll make sure everything is fully scriptable and customizable, allowing modders to create their own helicopter models, tweak flight behavior, and add custom assets.",
          "labels": ["gameplay", "modding"]
        },
        {
          "title": "🌎 Community Ecosystem",
          "image": "/roadmap/ecosystem.webp",
          "description": "We're aiming to create a richer and more integrated ecosystem for nanos world, starting with a revamped account system fully integrated with Steam that will include detailed player profiles, stats tracking, and dedicated webpages to showcase your content and creations, as well as those of other players.\n\nWe're also planning new dedicated pages for sharing content like code snippets, tutorials, and other helpful resources. Our goal is to promote a more collaborative and connected community where players can easily share, learn, and discover new content.",
          "labels": ["ui", "ux", "integration"]
        },
        {
          "title": "🎮 Ready to go Game-Modes",
          "image": "/roadmap/deathmatch.webp",
          "description": "Game-modes are the core of the game. Without them, there's nothing for players to really dive into. That's why we're making sure we have solid, long-term game modes ready before launch. These will be the key to attracting real players and keeping the community engaged.\n\nUntil then, we'll keep working with modders and scripters to create content and expand what's possible. We want to give the community the tools to experiment and help shape the game first.\n\nOnce we have game-modes and content that are polished and fun, we'll start building hype and bringing in streamers and players to showcase the experience. The goal is to launch with exciting and replayable modes that keep players coming back for more.",
          "labels": ["gameplay", "scripting", "modding"]
        }
      ]
    },
    {
      "title": "👍 planned should-have features",
      "description": "important additions that will improve the game but are not critical for launch",
      "items": [
        {
          "title": "🌐 CDN Server Content",
          "image": "/roadmap/cdn.webp",
          "description": "This is a community request to improve the asset distribution. We would allow server creators to specify a CDN (Content Delivery Network) server URL for assets to be downloaded (for Asset Packs not already in the Vault).\n\nClients will then automatically use this URL to download asset files, bypassing direct downloads from the game server itself. This would not only reduce server load and improve overall server performance, but also increase download speeds for players (especially those geographically distant from the server).\n\nThis is particularly beneficial for servers hosting large amounts of custom content that don't want them uploaded to Vault.",
          "labels": ["hosting", "community"]
        },
        {
          "title": "🛤️ Spline Entity",
          "image": "/roadmap/spline.webp",
          "description": "The Spline entity will give scripters the ability to create and manipulate splines dynamically within the game world. Splines can be used to define paths for AI, create roads and other curved surfaces, and much more.",
          "labels": ["scripting", "community"]
        },
        {
          "title": "🎭 Parties and Lobbies",
          "image": "/roadmap/lobbies.webp",
          "description": "Parties and Lobbies are all about making it easier to play with friends. The idea is to integrate Steam's SDK to allow players to create lobbies, invite their friends, and join servers together. Instead of everyone having to find and join a server separately, you'll be able to squad up and jump in as a group.\n\nThis feature would improve the social aspect of the game, making multiplayer sessions more fun and accessible. We'll be looking into how best to implement it while ensuring it works smoothly with our existing systems.",
          "labels": ["ui", "integration"]
        },
        {
          "title": "🔊 New Runtime Audio Formats",
          "image": "/roadmap/audios.webp",
          "description": "Currently we only support loading .ogg sounds in runtime (not cooked assets), but we're planning to expand this to support more audio formats, such as .wav, .mp3, and more.",
          "labels": ["scripting"]
        },
        {
          "title": "🚗 Vehicle AI",
          "image": "/roadmap/vehicle-ai.webp",
          "description": "Our initial focus for Vehicle AI will be to provide scripters with a simplified yet powerful system to direct vehicle movement. This initial implementation will allow scripters to programmatically give target locations to a vehicle, enabling it to autonomously locomote to specified locations.",
          "labels": ["scripting"]
        },
        {
          "title": "🛠️ Robust Assets Development Kit",
          "image": "/roadmap/adk.webp",
          "description": "Our current ADK solution is a bit limited, it is simply an Unreal Project with the same settings and definitions from our base game that allows you to cook your assets and use them in-game.\n\nWe're planning to improve this system by providing a more robust and user-friendly tool that will allow you to create, cook, copy and even upload your assets directly from the Unreal Editor. This will make the process of creating and sharing custom content much easier and more accessible to everyone.",
          "labels": ["modding", "ux", "integration"]
        },
        {
          "title": "💥 Breakable Entities with Chaos Destruction",
          "video": "/roadmap/chaos-destruction.webm",
          "description": "We're planning to introduce breakable entities using Unreal Engine's Chaos Destruction system. We already had some experiments with it in the past, but we're looking to expand it further and make it a core feature of the game.\n\nA challenge we will face is achieving reliable network replication of destruction events in multiplayer. Synchronizing dynamic destruction across all clients is complex and requires careful consideration. We need to ensure that all players experience the same destruction events simultaneously, and also synchronized after players reconnecting to the server.\n\nAnother challenge is to seamlessly incorporate this system with our existing entities, making sure they are cohesive with other existing entities such as Props.",
          "labels": ["gameplay", "modding"]
        },
        {
          "title": "🛍️ Store Marketplace",
          "image": "/roadmap/marketplace.webp",
          "description": "A dedicated Store Marketplace where scripters and creators can list, buy and sell scripts, packages and assets. The marketplace will support pricing, licensing options, previews, ratings, and secure transactions.",
          "labels": ["modding", "integration", "hosting"]
        },
        {
          "title": "🌊 Drowning System",
          "image": "/roadmap/drowning.webp",
          "description": "Right now, characters can stay underwater forever without any issues, which isn't exactly realistic. We're planning to introduce a drowning system where characters will need to come up for air. If they stay submerged too long, they'll start losing health and eventually die.\n\nOf course, we want this to be flexible, so scripters will have full control over it—whether to enable or disable it, adjust timers, or even modify how it works. This will add more depth (literally) to water-based gameplay and open up new possibilities for custom game modes.",
          "labels": ["gameplay", "scripting"]
        },
        {
          "title": "📦 Built-in Asset Packs",
          "image": "/roadmap/props.webp",
          "description": "We're planning to have a set of built-in asset packs that will come with the game by default. These packs will include a variety of  Props, Particles, Weapons, Sounds, Vehicles, Materials, Characters and even Animal meshes, and other assets that can be used to create custom content.\n\nCurrently we already have some of these assets in the game, but we're planning to expand, improve and standardize them.\n\nThe idea is to have a small and optimized set of meshes that will serve as a starting point for modders and scripters to start blocking out and creating content before needing to import custom assets.",
          "labels": ["gameplay", "scripting"]
        },
        {
          "title": "🔣 FSR Integration",
          "image": "/roadmap/fsr.webp",
          "description": "We're planning to integrate AMD's FidelityFX Super Resolution (FSR) technology into the game, allowing AMD GPU players to use this feature.",
          "labels": ["integration", "optimization"]
        },
        {
          "title": "🛡️ Anti-Cheat",
          "image": "/roadmap/eac.webp",
          "description": "Implementing a robust anti-cheat system is crucial for maintaining fair gameplay and protecting the integrity of multiplayer matches.\n\nWe're planning to integrate several anti-cheat measures that will detect and prevent common exploits, cheats, and malicious modifications. And also we are considering integrating a third-party tool (such as EAC) on client to protect the game.\n\nOur goal is to create a secure gaming environment where players can enjoy the game without worrying about unfair advantages, while still maintaining the flexibility that makes nanos world great for modding and customization.",
          "labels": ["gameplay"]
        },
        {
          "title": "💰 Monetization Tools",
          "image": "/roadmap/monetization.webp",
          "description": "We're planning to implement an integrated official monetization tool that will allow server owners to sustainably operate their communities and servers. This tool would provide flexible options for implementing in-game purchases, donations, premium memberships, and other revenue models.\n\nThe system would include secure payment processing integration, customizable shop interfaces, subscription management, and detailed analytics to help server owners track their revenue and player engagement.\n\nThis tool would be optional and configurable, allowing each community to choose the monetization approach that best fits their needs.",
          "labels": ["hosting", "integration", "ui"]
        },
        {
          "title": "🎥 Culling/Streaming System",
          "image": "/roadmap/culling.webp",
          "description": "To improve performance, especially on servers with many entities, we're planning to implement a culling/streaming system.\n\nThis system will manage which entities are actively streamed for each player based on their location and relevance. Entities that are far away from the player will not be streamed.\n\nScripters will have control over culling behavior, allowing them to specify which entities should always remain active or define custom culling rules based on gameplay needs.",
          "labels": ["optimization", "scripting"]
        },
        {
          "title": "❔ More to come...",
          "image": "/roadmap/question.webp",
          "description": "We have much more plans and features to be implemented! We are constantly updating this board and refreshing our roadmap, stay tuned for more updates!\n\nAlso, if you have ideas or suggestions for new features, feel free to share them with us on our Feedback Hub!",
          "labels": [],
          "external_link": "/feedback",
          "external_link_title": "Feedback Hub"
        }
      ]
    },
    {
      "title": "💭 under analysis features",
      "description": "desirable features in review and not guaranteed to be worked on",
      "items": [
        {
          "title": "🎭 Metahuman Support",
          "image": "/roadmap/metahuman.webp",
          "description": "Unreal's Metahuman is a tool that lets developers create highly realistic human characters for games and other projects. It's pretty cool because it offers detailed customization options, making characters look and move in a lifelike way.\n\nWe're excited about the idea of integrating Metahuman into nanos world. However, we know that supporting different skeletons can be tricky. Right now, we plan to rework our current character to be compatible with Unreal Engine 5's skeleton and new animations. As we do this, we'll study how we might bring Metahuman into the mix. It's a possibility we're keen on, but we want to make sure it fits well with our existing setup.",
          "labels": ["modding", "integration", "community"],
          "external_link": "https://www.unrealengine.com/en-US/metahuman",
          "external_link_title": "Unreal Metahuman"
        },
        {
          "title": "🔧 Steam Workshop Support",
          "image": "/roadmap/workshop.webp",
          "description": "Steam Workshop is a platform that lets players create, share, and download user-generated content like mods, maps, and skins for their favorite games.\n\nHowever, we're focusing on enhancing our own custom solution, the Vault, which is already in place and undergoing significant improvements.\n\nWhile Steam Workshop offers a centralized hub for user-generated content, we believe that our tailored approach with the Vault will better serve our community's specific needs.\n\nThat said, we're open to exploring ways to integrate Steam Workshop in the future, but for now, our priority is to refine and expand the Vault's capabilities.",
          "labels": ["modding", "integration", "community"]
        },
        {
          "title": "👩‍💻 Asynchronous Scripting",
          "image": "/roadmap/async.webp",
          "description": "Asynchronous scripting is indeed a topic frequently discussed and requested by the community. Currently our scripting system is synchronous, meaning that scripts run one after the other in a single thread. This could potentially lead to performance issues if scripts take too long to execute.\n\nAlthough we didn't see any major problems so far, we understand that asynchronous scripting could be beneficial for certain use cases. and in an ideal world, we'd love to have it, but it's a complex feature that requires careful planning and execution.\n\nCurrently our focus is on improving the core game experience and adding new features that will benefit the majority of players. Asynchronous scripting is a more advanced feature that would primarily benefit scripters and hosting performance. We're keeping it in mind for the future, but it's not a priority at the moment.",
          "labels": ["scripting", "optimization", "community"]
        }
      ]
    },
    {
      "title": "✅ all released features",
      "description": "completed features that are already available in the game",
      "items": [
        {
          "title": "🏪 Better Vault",
          "image": "/roadmap/vault.webp",
          "description": "The Vault is our in-game system for managing and sharing community-created content. We're planning significant improvements to make it easier to use, more reliable, and offer better organization and discovery of assets.\n\nAlthough we already have a functional in-game Vault system that allows players to share and download custom content, we recognize its current implementation has limitations, particularly when it comes to backend implementation and integration.\n\nOur goal with this rework is to significantly improve the Vault's backend services and associated web pages. Making the process of uploading new content, managing versions and details much easier for creators to share their work with the community.",
          "labels": ["ui", "ux", "integration", "optimization"]
        },
        {
          "type": "date",
          "title": "2025"
        },
        {
          "title": "📜 ToS & Privacy Policy",
          "image": "/roadmap/tos.webp",
          "description": "Before the official release, we need to establish comprehensive Terms of Service (ToS) and Privacy Policy documents. These legal documents are essential for protecting both the development team and the player community, clearly defining the rights, responsibilities, and acceptable use of the platform.\n\nThey will cover important aspects such as intellectual property rights, user-generated content policies, monetization, moderation guidelines, privacy policies, and liability limitations. We're working to ensure these documents are clear, fair, and transparent while providing the necessary legal framework for operating the game and its services.",
          "labels": ["organizational"]
        },
        {
          "title": "🌟 Badge System",
          "image": "/roadmap/badges.webp",
          "description": "We've introduced a Badge System to recognize and reward players for their participation in events. Badges are displayed on your profile and serve as a testament to your contributions to the community. This system allows us to grant special unique badges for testers, content creators, and event special players.",
          "labels": ["released", "integration", "ui"]
        },
        {
          "title": "🔐 Client Scripting Files Encryption",
          "image": "/roadmap/encryption.webp",
          "description": "We've implemented an encryption system for client-side downloaded scripting files, providing an additional layer of protection for intellectual property and custom code, meaning no script file can be read from clients.",
          "labels": ["released", "scripting", "hosting"]
        },
        {
          "title": "⏩ WebUI Hardware Acceleration",
          "image": "/roadmap/accelerated.webp",
          "description": "This feature allows the CEF (Chromium Embedded Framework) to utilize your GPU for rendering, significantly improving performance and reducing CPU usage, especially for complex UIs with CSS animations.\n\nThis integration required substantial effort, including adapting the underlying graphics API (DirectX) to work seamlessly with Unreal Engine Textures. The result is smoother animations and a more responsive UI experience for players.",
          "labels": ["released", "ui", "ux", "optimization"]
        },
        {
          "title": "🕹️ Enhanced Input System",
          "image": "/roadmap/eis.webp",
          "description": "We managed to migrate from the old deprecated Unreal's input system to this new modern and flexible system.",
          "labels": ["released", "integration"]
        },
        {
          "title": "🧪 Profiling: Network Stats",
          "image": "/roadmap/entities-network-stats.webp",
          "description": "We've added a new feature to the Profiling tool that allows you to see detailed network stats for each entity in the game. This is very useful for debugging and optimizing the core entities and see how much bandwidth each entity is using.",
          "labels": ["released", "optimization"]
        },
        {
          "title": "🔣 Static Lighting Support",
          "image": "/roadmap/static-light.webp",
          "description": "We added support for static lighting in the game, allowing you to bake lighting into your maps for better performance and visual quality.",
          "labels": ["released", "modding"]
        },
        {
          "title": "🔣 DLSS Integration",
          "image": "/roadmap/dlss.webp",
          "description": "We've integrated NVIDIA's Deep Learning Super Sampling (DLSS) technology into the game, allowing players to use this features in the game for better performance and visual quality.",
          "labels": ["released", "integration", "optimization"]
        },
        {
          "type": "date",
          "title": "2024"
        },
        {
          "title": "🧩 Native Gizmo Tool",
          "video": "/roadmap/gizmo.webm",
          "description": "We integrated a native Gizmo tool that allows scripters to create and manipulate 3D objects in the game world. This tool is perfect for creating custom editor tools, building systems, and more.",
          "external_link": "/docs/next/scripting-reference/static-classes/gizmo",
          "external_link_title": "Gizmo",
          "labels": ["released", "scripting"]
        },
        {
          "title": "⚙️ Escape Menu Customization",
          "image": "/roadmap/escape-menu.webp",
          "description": "Scripters can now add basic custom elements to the escape menu, such as text, titles, and highlighted useful information. This allows a simple customization of the in-game menu.",
          "external_link": "/blog/march-2023#escape-menu-information",
          "external_link_title": "March 2023 Blog",
          "labels": ["released", "gameplay", "ui"]
        },
        {
          "title": "🚤 Water Vehicle Entity",
          "video": "/roadmap/boat.webm",
          "description": "We've added a new Water Vehicle entity that allows scripters to create boats and other water-based vehicles. This entity comes with built-in physics and buoyancy, making it easy to create realistic water vehicles.",
          "external_link": "/docs/next/scripting-reference/classes/vehicle-water",
          "external_link_title": "Vehicle Water",
          "labels": ["released", "scripting", "modding", "ui"]
        },
        {
          "title": "💥 Vehicle Health",
          "video": "/roadmap/vehicle-explosion.webm",
          "description": "Vehicles now have a health attribute, and they will explode when their health reaches zero. This adds a damage and destruction mechanic to vehicles.",
          "labels": ["released", "gameplay"]
        },
        {
          "title": "🧩 3D Widget",
          "image": "/roadmap/widget3d.webp",
          "description": "The Widget3D entity allows scripters to create 3D Widgets that can be placed in the game world. This is perfect for creating interactive 3D interfaces, HUDs, and more.",
          "external_link": "/docs/next/scripting-reference/classes/widget-3d",
          "external_link_title": "Widget3D",
          "labels": ["released", "scripting", "modding", "ui"]
        },
        {
          "title": "📦 Package Creation Flow",
          "video": "/blog/2023-may/new-map-package.webm",
          "description": "We added an in-game package creation flow that allows you to easily create custom Packages and Asset Packs from the main menu UI. Also it allows you uploading new patches directly from the game.",
          "labels": ["released", "ux", "ui"]
        },
        {
          "title": "🔔 Main Menu Notifications",
          "image": "/roadmap/notifications.webp",
          "description": "We've added a new notification system to the main menu that displays messages and alerts that happened in the game.",
          "labels": ["released", "ui"]
        },
        {
          "type": "date",
          "title": "2023"
        },
        {
          "title": "🌚 Single Lua VM",
          "image": "/roadmap/lua-vm-rule.webp",
          "description": "For a long time, we've been using multiple Lua VMs to run scripts in the game. This has caused some issues with performance, memory usage and package intercommunication, so we decided to switch to a single Lua VM. This change improves the performance and make it easier to manage scripts as a whole.",
          "labels": ["released", "optimization", "scripting"],
          "external_link": "/blog/december-2022#one-lua-virtual-machine",
          "external_link_title": "December 2022 News Blog"
        },
        {
          "title": "⚙️ Game Mode Settings",
          "image": "/roadmap/new-game-settings.webp",
          "description": "We've added a new Game Mode Settings system that allows scripters to create custom settings for their game modes, those settings can be chosen from the main menu when starting a new game, or when starting a server from the command-line.",
          "labels": ["released", "ui", "ux", "hosting"],
          "external_link": "/blog/december-2022#gamemode-settings",
          "external_link_title": "December 2022 News Blog"
        },
        {
          "title": "🧩 Widget Blueprint",
          "image": "/roadmap/widget.webp",
          "description": "The widget entity allows spawning custom UserWidget entities, providing a way to create native user interfaces within the game.",
          "external_link": "/docs/next/scripting-reference/static-classes/widget",
          "external_link_title": "Widget",
          "labels": ["released", "scripting", "modding", "ui"]
        },
        {
          "title": "⌨️ Console Commands",
          "image": "/roadmap/console-commands.webp",
          "description": "This feature allows scripters to create custom console commands that can be executed by players or administrators within the game's or server's console.",
          "external_link": "/docs/next/scripting-reference/static-classes/console",
          "external_link_title": "Console",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🌅 Ultra Dynamic Sky Integration",
          "image": "/roadmap/uds.webp",
          "description": "We natively integrated Ultra Dynamic Sky, one of best Unreal Marketplace Asset Packs, now we provide a dynamic sky and weather solution for your game-modes!",
          "labels": ["released", "integration", "scripting", "modding"],
          "external_link": "/docs/scripting-reference/static-classes/sky",
          "external_link_title": "Sky Static Class"
        },
        {
          "title": "🌌 Dimensions",
          "image": "/roadmap/dimensions.webp",
          "description": "We've introduced the Dimension system, allowing scripters to create and manage multiple isolated game spaces within the same server. Players and entities in different dimensions won't be able to interact with each other. This is perfect for instancing, private areas, or parallel worlds.",
          "labels": ["released", "scripting", "community"],
          "external_link": "/docs/core-concepts/scripting/dimensions",
          "external_link_title": "Dimensions"
        },
        {
          "title": "🖥️ 3D WebUI",
          "video": "/blog/2022-july/cinema.webm",
          "description": "With the new methods added to the WebUI entity, you can take the WebUI material and apply it to any 3D 'paintable' entity in the game! This means you can create interactive TVs, cinemas, in-game screens, or even complex 3D user interfaces.",
          "labels": ["released", "scripting"],
          "external_link": "/docs/next/scripting-reference/classes/web-ui#using-a-webui-as-mesh-material",
          "external_link_title": "WebUI SetMaterialFromWebUI"
        },
        {
          "title": "🌐 WebUI CEF Based",
          "image": "/roadmap/webui.webp",
          "description": "We've integrated the Chromium Embedded Framework (CEF), enabling scripters to create custom user interfaces using web technologies like HTML, CSS, and JavaScript.",
          "external_link": "/docs/next/scripting-reference/classes/web-ui",
          "external_link_title": "WebUI",
          "labels": ["released", "scripting", "ui"]
        },
        {
          "title": "🌍 Menu Rework & Rebrand",
          "image": "/roadmap/menu.webp",
          "description": "We've completely reworked the game's menus and UI as part of a full rebrand. Every interface has been redesigned to be more modern, intuitive, and visually appealing. This update improves navigation, enhances the overall user experience, and aligns with our vision for the game. The new UI has set a fresh foundation for future updates and features.",
          "labels": ["released", "ui"],
          "external_link": "/blog/june-2022",
          "external_link_title": "June 2022 News Blog"
        },
        {
          "title": "🫂 P2P Servers",
          "image": "/roadmap/p2p.webp",
          "description": "We've integrated Steam's P2P (Peer-to-Peer) servers, allowing players to host their own servers without the need for a dedicated server or to open ports in the router.",
          "external_link": "/blog/may-2022#p2p-servers",
          "external_link_title": "May 2022 News Blog",
          "labels": ["released", "hosting"]
        },
        {
          "title": "💾 Database Built-in Integration",
          "image": "/roadmap/db.webp",
          "description": "We've successfully integrated database support for scripting, allowing scripters to connect to databases and use them however they need. This gives more flexibility for storing player data, leaderboards, inventories, and any other persistent information. It's a powerful tool that opens up countless possibilities for custom game-modes and systems.",
          "external_link": "/docs/next/scripting-reference/classes/database",
          "external_link_title": "Database",
          "labels": ["released", "scripting", "integration"]
        },
        {
          "title": "🔣 Blueprint Entity",
          "image": "/roadmap/bp-entity.webp",
          "description": "The Blueprint Entity is a new entity that allows you to create custom entities using Blueprints! This will allow you to create custom entities with custom logic and behavior, and share them with the community!",
          "external_link": "/docs/next/scripting-reference/classes/blueprint",
          "external_link_title": "Blueprint",
          "labels": ["released", "scripting"]
        },
        {
          "title": "5️⃣ Port to Unreal Engine 5",
          "image": "/roadmap/ue5.webp",
          "description": "We've successfully upgraded the game to Unreal Engine 5, bringing improved performance, better visuals, and access to the latest engine features.",
          "labels": ["released", "community"]
        },
        {
          "title": "🎥 Scene Capture Entity",
          "video": "/blog/january/scene-capture.webm",
          "description": "The SceneCapture is a camera that captures what it sees and renders it onto a material. You can use this material anywhere: apply it to any 'paintable' entity or even UI elements. Perfect for security cameras, mirrors, picture-in-picture effects, or anything else you can come up with.",
          "external_link": "/docs/next/scripting-reference/classes/scene-capture",
          "external_link_title": "Scene Capture",
          "labels": ["released", "scripting"]
        },
        {
          "title": "👶 Character Simple Class",
          "image": "/roadmap/character-simple.webp",
          "description": "The Character Simple class is a simplified version of the Character class, designed for scripters who want to create custom characters without the complexity of the full Character class. It's perfect for creating NPCs, animals, or other simple characters.",
          "labels": ["released", "scripting", "modding", "community"],
          "external_link": "/docs/scripting-reference/classes/character-simple",
          "external_link_title": "Character Simple"
        },
        {
          "title": "📺 In-game Console",
          "image": "/roadmap/console.webp",
          "description": "We've added an in-game console that allows players and administrators to execute commands, scripts and read the logs directly in the game.",
          "labels": ["released", "ui"]
        },
        {
          "type": "date",
          "title": "2022"
        },
        {
          "title": "📷 Native Top-Down ViewMode",
          "video": "/blog/november/top-down.webm",
          "description": "We've added a new Top-Down view mode, allowing players to control their characters from a top 2D perspective. This opens up possibilities for different gameplay styles.",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🧱 Decal Entity",
          "image": "/roadmap/decals.webp",
          "description": "We've added the Decal entity, letting scripters spawn and control decals dynamically at runtime. This means you can place blood splatters, bullet holes, custom markings, or any other visual effects on surfaces in real-time.",
          "external_link": "/docs/next/scripting-reference/classes/decal",
          "external_link_title": "Decal",
          "labels": ["released", "scripting"]
        },
        {
          "title": "💬 Billboard Entity",
          "image": "/roadmap/billboard.webp",
          "description": "The Billboard entity is here! This is a simple but powerful feature that lets you display 2D textures that always face the camera. You can attach them to anything: characters, props, or even place them freely in the world.",
          "external_link": "/docs/next/scripting-reference/classes/billboard",
          "external_link_title": "Billboard",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🌐 HTTP Requests",
          "image": "/roadmap/http-request.webp",
          "description": "The HTTP class allows scripters to make HTTP requests within their scripts. This allows for integration with external web services and data sources.",
          "external_link": "/docs/next/scripting-reference/static-classes/http",
          "external_link_title": "HTTP",
          "labels": ["released", "scripting"]
        },
        {
          "title": "💨 Sandbox Game Mode",
          "image": "/roadmap/sandbox.webp",
          "description": "TODO",
          "external_link": "https://github.com/nanos-world/nanos-world-sandbox",
          "external_link_title": "Sandbox GitHub Page",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🗡️ Melee Weapons",
          "video": "/blog/november/melee.webm",
          "description": "Melee weapons are fully implemented, allowing scripters and modders to import custom weapon meshes and animations. This system brings more variety to the existing combat. While it's already functional, we still plan to improve it further, refining animations, hit detection, and overall gameplay feel.",
          "external_link": "/docs/next/scripting-reference/classes/melee",
          "external_link_title": "Melee",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🌐 New Web Page",
          "image": "/roadmap/webpage.webp",
          "description": "We've launched a new website for nanos world, featuring a fresh design, improved navigation, and updated content marketing the game.",
          "external_link": "https://nanos-world.com",
          "external_link_title": "nanos world",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🏪 In-game Vault",
          "image": "/roadmap/vault.webp",
          "description": "With the In-game Vault, players and scripters can browse, download, update, and even upload their Asset Packs and Packages straight from inside the game. You can check out descriptions, screenshots and even rate creations to help highlight the best ones.",
          "labels": ["released", "ui", "ux"]
        },
        {
          "title": "🧪 Profiling: Performance Stats",
          "image": "/roadmap/profiling.webp",
          "description": "We've added a new feature to the Profiling tool that allows you to see detailed performance stats for each operation executed in the game. This is very useful for debugging and optimizing both your scripts and the game itself.",
          "labels": ["released", "optimization", "integration"]
        },
        {
          "title": "🔗 Cable Entity",
          "image": "/roadmap/cables.webp",
          "description": "This feature introduces a new entity type specifically designed for creating and manipulating cables within the game world.",
          "external_link": "/docs/next/scripting-reference/classes/cable",
          "external_link_title": "Cable",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🎨 Customizable Materials/Textures for Entities",
          "image": "/roadmap/materials.webp",
          "description": "We added new methods to allow scripting to dynamically modify the materials and textures applied to entities during runtime.",
          "external_link": "/docs/next/scripting-reference/classes/base-classes/paintable",
          "external_link_title": "Paintable Base Class",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🔍 Traces / RayCasting",
          "image": "/roadmap/traces.webp",
          "description": "This feature enables scripters to perform world traces (raycasting) to gather information about the game world. This is useful for hit detection, object detection, and other interactions.",
          "external_link": "/docs/next/scripting-reference/static-classes/trace",
          "external_link_title": "Trace",
          "labels": ["released", "scripting"]
        },
        {
          "title": "✨ Particle Entity",
          "image": "/roadmap/particle.webp",
          "description": "This entity type gives scripters the capability to spawn and control particle systems within the game world.",
          "external_link": "/docs/next/scripting-reference/classes/particle",
          "external_link_title": "Particle",
          "labels": ["released", "scripting", "modding"]
        },
        {
          "title": "🌊 Water Physics",
          "video": "/blog/2022-april/water-buoyancy.webm",
          "description": "We've integrated Unreal Engine's Water system, enabling entities to realistically interact with water physics. This integration allows for buoyancy, wave interaction, and other water-related effects.",
          "labels": ["released", "gameplay"]
        },
        {
          "title": "🪆 Ragdoll Sync",
          "image": "/roadmap/ragdoll-sync.webp",
          "description": "Ragdoll Sync ensures that the main position of a character's ragdoll stays the same for all players, preventing weird desync issues where characters end up in completely different spots. However, it's important to note that individual bones aren't synced, only the overall location—so minor differences in how the ragdoll settles might still occur.",
          "labels": ["released", "gameplay"]
        },
        {
          "title": "🖼️ Custom Loading Screen",
          "image": "/roadmap/loading-screen.webp",
          "description": "Server creators now have the ability to personalize the loading screen displayed to players as they join their servers. This allows for branding and custom information during the loading process.",
          "external_link": "/docs/next/core-concepts/packages/loading-screen",
          "external_link_title": "Loading Screen",
          "labels": ["released", "ui"]
        },
        {
          "type": "date",
          "title": "2021"
        },
        {
          "title": "🛜 Network Debugging",
          "image": "/roadmap/debug-visualizer.webp",
          "description": "We've added a new Network Debugging tool that allows you to visualize the network traffic between the server and clients on each entity.",
          "external_link": "/docs/next/core-concepts/scripting/authority-concepts#debugging-network--network-authority",
          "external_link_title": "Network Authority Page",
          "labels": ["released", "optimization", "gameplay"]
        },
        {
          "title": "💬 Built-in Chat",
          "image": "/roadmap/chat.webp",
          "description": "This feature adds a native text chat system to the game, allowing players to communicate with each other through text messages.",
          "labels": ["released", "gameplay"]
        },
        {
          "title": "📦 Static Mesh Entity",
          "image": "/roadmap/static-mesh.webp",
          "description": "This simple entity allows spawning and manipulating Static Meshes in the world.",
          "external_link": "/docs/next/scripting-reference/classes/static-mesh",
          "external_link_title": "Static Mesh",
          "labels": ["released", "scripting"]
        },
        {
          "title": "⭐ Steam Achievements",
          "image": "/roadmap/achievements.webp",
          "description": "We integrated Steam's Achievements into the game, allowing players to unlock achievements and accumulate stats by doing game actions.",
          "labels": ["released", "gameplay"]
        },
        {
          "title": "🔤 3D Text Entity",
          "image": "/roadmap/3dtext.webp",
          "description": "This entity allows for the creation of 3D text rendered within the game world.",
          "external_link": "/docs/next/scripting-reference/classes/text-3d",
          "external_link_title": "Text3D",
          "labels": ["released", "scripting"]
        },
        {
          "title": "🎮 Discord Integration",
          "image": "/roadmap/discord-integration.webp",
          "description": "This integration allows scripters to modify the Rich Presence status of the game within Discord. This allows for dynamic updates to player status and activity displayed on Discord.",
          "external_link": "/docs/next/core-concepts/scripting/discord-integration",
          "external_link_title": "Discord Integration",
          "labels": ["released", "scripting", "integration"]
        },
        {
          "title": "🔊 Sound Entity",
          "image": "/roadmap/sounds.webp",
          "description": "This entity allows for the spawning and playback of sounds within the game world.",
          "external_link": "/docs/next/scripting-reference/classes/sound",
          "external_link_title": "Sound",
          "labels": ["released", "scripting"]
        },
        {
          "title": "💨 Steam Page",
          "image": "/roadmap/steam.webp",
          "description": "We've launched the game on Steam as a coming soon™ page, allowing all testers to easily be able to download it and keep the game update, also allowing us to reach a broader audience and start accumulating wishlists.",
          "external_link": "https://store.steampowered.com/app/1841660/nanos_world/",
          "external_link_title": "nanos world™ on Steam",
          "labels": ["released"]
        },
        {
          "title": "📄 Reworked Docs",
          "image": "/roadmap/new-docs.webp",
          "description": "We've completely reworked our documentation using Docusaurus, now it's more user-friendly, visually appealing, and easier to navigate. Also it provides multi-languages and even automated API definitions, a news blog and a lot of useful information.",
          "external_link": "/blog/new-docs",
          "external_link_title": "New Docs Blog Post",
          "labels": ["released"]
        },
        {
          "type": "date",
          "title": "2020"
        },
        {
          "title": "🛠️ Assets Development Kit",
          "image": "/roadmap/adk.webp",
          "description": "This Assets Development Kit (ADK) Unreal Engine project provides modders a base project to create custom content such as maps and meshes",
          "external_link": "/docs/next/assets-modding/creating-assets/adk-assets-development-kit",
          "external_link_title": "Assets Development Kit",
          "labels": ["released", "modding"]
        },
        {
          "title": "🗣️ VOIP System",
          "image": "/roadmap/voip.webp",
          "description": "This system introduces voice over IP (VOIP) communication, enabling players to engage in real-time voice chat with one another within the game.",
          "labels": ["released", "gameplay", "scripting"]
        },
        {
          "title": "🙌 Prop Grabbing",
          "image": "/roadmap/prop-grabbing.webp",
          "description": "This gameplay feature allows characters to pick up and move props within the game world.",
          "labels": ["released", "gameplay"]
        },
        {
          "title": "🔫 Weapon Entity",
          "video": "/blog/weapons-improvements/m1911.webm",
          "external_link": "/docs/next/scripting-reference/classes/weapon",
          "external_link_title": "Weapon",
          "labels": ["released", "scripting", "gameplay", "modding"]
        },
        {
          "title": "🚗 Vehicle Entity",
          "video": "/blog/2022-march/tire-skid.webm",
          "external_link": "/docs/next/scripting-reference/classes/vehicle-wheeled",
          "external_link_title": "Vehicle Wheeled",
          "labels": ["released", "scripting", "gameplay", "modding"]
        },
        {
          "title": "📦 Prop Entity",
          "image": "/roadmap/prop-entity.webp",
          "external_link": "/docs/next/scripting-reference/classes/prop",
          "external_link_title": "Prop",
          "labels": ["released", "scripting", "gameplay", "modding"]
        },
        {
          "title": "💣 Grenade Entity",
          "image": "/roadmap/grenade.webp",
          "external_link": "/docs/next/scripting-reference/classes/grenade",
          "external_link_title": "Grenade",
          "labels": ["released", "scripting", "gameplay", "modding"]
        },
        {
          "type": "date",
          "title": "2019"
        }
      ]
    }
  ]
}
